app/controllers/messages_controller.rb

INSERT INTO "messages" ("name", "number", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Jim Harbaugh"], ["number", 123456789], ["created_at", "2018-04-08 22:29:17.559069"], ["updated_at", "2018-04-08 22:29:17.559069"]]
---
  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save